runs/20260602T151124-t8-full-waltest/pgbench-opera-w1.log
pgbench (18.1 (Debian 18.1-1.pgdg13+2))
progress: 60.0 s, 10594.0 tps, lat 24.034 ms stddev 29.695, 0 failed
progress: 120.0 s, 15558.9 tps, lat 16.455 ms stddev 20.329, 0 failed
progress: 180.0 s, 25763.6 tps, lat 9.939 ms stddev 14.740, 0 failed
progress: 240.0 s, 17865.4 tps, lat 14.318 ms stddev 22.222, 0 failed
progress: 300.0 s, 15873.1 tps, lat 16.138 ms stddev 20.594, 0 failed
progress: 360.0 s, 24807.7 tps, lat 10.320 ms stddev 14.783, 0 failed
progress: 420.0 s, 19595.8 tps, lat 13.059 ms stddev 20.583, 0 failed
progress: 480.0 s, 16796.5 tps, lat 15.243 ms stddev 20.165, 0 failed
progress: 540.0 s, 23228.5 tps, lat 11.023 ms stddev 15.354, 0 failed
progress: 600.0 s, 22897.8 tps, lat 11.174 ms stddev 17.356, 0 failed
progress: 660.0 s, 17024.8 tps, lat 15.036 ms stddev 20.568, 0 failed
progress: 720.0 s, 20391.5 tps, lat 12.560 ms stddev 16.479, 0 failed
progress: 780.0 s, 26324.6 tps, lat 9.720 ms stddev 14.723, 0 failed
progress: 840.0 s, 17962.3 tps, lat 14.256 ms stddev 20.203, 0 failed
progress: 900.0 s, 18260.9 tps, lat 14.019 ms stddev 17.819, 0 failed
transaction type: /var/run/pgbench-wal-stress.pgbench
scaling factor: 1040
query mode: simple
number of clients: 256
number of threads: 256
maximum number of tries: 1
duration: 960 s
number of transactions actually processed: 19264188
number of failed transactions: 0 (0.000%)
latency average = 12.753 ms
latency stddev = 18.468 ms
initial connection time = 303.089 ms
tps = 20070.399866 (without initial connection time)